//// 672. 灯泡开关 Ⅱ
//
//int flipLights(int n, int presses)
//{
//    // 共八种状态：初始状态，开关1，开关2，开关3，开关4，开关1+开关4，开关2+开关4，开关3+开关4
//    // 1+2=3，1+3=2，2+3=1
//    if (presses == 0)
//        return 1; // 111111...
//    if (n == 1)
//        return 2; // 0， 1
//    if (n == 2)
//        return presses == 1 ? 3 : 4; // 00，10，01 开关1，开关2，开关3/开关4
//    else
//        return presses == 1 ? 4 : presses == 2 ? 7 : 8;
//    // presses == 1 : 000，101，010，011 开关1，开关2，开关3, 开关4
//    // presses == 2 : 111，010，101，100，000，001，110 x+x, 1+2, 1+3, 1+4, 2+3, 2+4, 3+4
//    // presses >= 3 : presses == 2 + 011 多一个 x*2k+4 或 2+1+3 +x*2k+4
//}
//
